package com.ict01.grammar01;

public class Ex00_3 {
	// 형변환 : 자동형변환과 강제형변환

	// 자동형 변환 : 작은 자료형이 큰 자료형에 저장될 때
	// char를 int 에 저장할 수 있다.
	// int를 long 에 저장할 수 있다.
	// long이 float나 double 에 저장할 수 있다.

	// 강제형 변환 : 큰자료형을 작은자료형으로 저장할때
	// 오류가 발생한다.
	// 강제로 형 변환해서 오류를 나지 않한다.
	// 그러나, 데이터를 손실할 가능성이 있다.
	// 강제형 변환 방법 : = 를 기준으로 무조건 왼쪽자료형에 맞춘다.
	// = (왼쪽자료형)(대상);

	// 산술연산자 ; + , - , * , /, %(나머지)

	// 증감 연산자 : 1만큼 증거하거나 감소시키는 연산자이다.
	// char, 정수, 실수에 사용 가능
	// ++ 변수 : 먼저 현재변수값에 1을 증가 시키고 나머지 연산한다.
	// 변수 ++ : 현재 변수값을 가지고 연산 한 후 나중에 1증가 시킨다.

	// 비교연산자 : 변수나 상수의 값을 비교할때 사용
	// 결과는 항상 boolean 이다.
	// boolean 형은 조건식에 사용된다.
	// 자료형이 String인 경우에는 사용할지 말자

	// 논리연산자 : &&(AND, 논리곱), ||(OR, 논리합), ! (NOT, 논리부정)
	// 사용되는 자원 : boolean형, 비교연산, 논리연산
	// 결과는 boolean형 => 조건식에 사용된다.
	
	// 대입연산자 : 특정값이나 객체의 주소를 변수에 기억시키때 사용(저장)
    //               = , +=, -=, *=, /=, %=
	
	// 삼항연산자 (조건연산자 = 조건문인 if ~ else 문과 같다)
}
