package com.ict01.grammar01;

public class Ex00_2 {
	// 자료형 : 데이터 타입 ( 자바에서 데이터를 처리할때 분류하는 기준)

	// 자료형과 데이터를 처리하는 방법
	// 자료형 변수이름 ; 선언 ( 초기에 한번만 한다.)
	// 변수이름 = 데이터; 데이터 저장

	// 한번에 처리
	// 자료형 변수이름 = 데이터

	// 자료형 : DataType : 자바에서 정보를 처리할때 구분하는 형태
	// 1. 기본자료형 : 컴파일러에 의해서 해석되는 자료형
	// boolean, char, byte, short, int, long, float, double
	// 2. 참조자료형 : 클래스를 자료형으로 선언
	
	// 논리형 : boolean (true 또는 fasle => 둘 중 하나 )
	// 문자형 : char , 한 글자 저장 (한글,한자,특수문자,처리가능)
	// 문자를 사용하기 위해서는 홑따옴표를 사용한다.
	// 숫자를 사용 할 수 있다.
	// 최종 저장은 숫자로 저장된다.(연산가능)
	// 호출하면 문자로 나온다.

	// 정수형 : 소숫점이 없는 숫자
	// 정수형 : byte < short < int < long
	// 정수형의 기본은 int 이다.
	// 주의 사항 : byte, short 를 연산하면 결과는 무조건 int 이상

	// byte : -128 ~ 127 사이 숫자만 사용 가능
	// short : -32768 ~ 32767 범위 안에 존재하는 정수를 저장

	// int와 long 은 범위를 외울 필요없다.
	// 앞으로 일반적인 정수는 int
	// 아주 큰 정수를 사용하고자 할때는 long을 사용한다.
	// long 에는 숫자 뒤에 L 또는 l를 붙인다.(생략가능)

	// 실수 : 소숫점이 존재하는 수
	// 무조건 정수보다는 크다.
	// 실수의 기본형은 double 이다.
	// float는 숫자 뒤에 F 또는 f를 붙인다.(생략안됨)
	// char < 정수(int<long) < float < double ;
}
