package com.ict01.grammar01;

public class Ex00_1 {
	// 메인메소드 : 메소드란 기능, 하는 것, 동작을 의미함
	// 메인메소드는 JVM이 호출해서 자바프로그램을 실행시키는
	// 시작포인트이다.
	// public static void main(String[] args) {}
	
	// System.out => 모니터
	// println("내용") => 출력스트림(writer)
	// 즉 모니터에 내용을 출력하라는 뜻
	// System.out.println("이름 : 노종문 ");
	
	// 자료형 : 데이터 타입 ( 자바에서 데이터를 처리할때 분류하는 기준)
	
	// 자료형과 데이터를 처리하는 방법
	// 자료형  변수이름 ;   선언 ( 초기에 한번만 한다.)
    // 변수이름 = 데이터;   데이터 저장
	
	// 한번에 처리
	// 자료형 변수이름 = 데이터 
	
	// 논리형 : boolean (true 또는 fasle  => 둘 중 하나 )  
    // 문자형 :  char , 한 글자 저장 (한글,한자,특수문자,처리가능) 
    //                 문자를 사용하기 위해서는 홑따옴표를 사용한다.
    //                 숫자를 사용 할 수 있다.
    //                 최종 저장은 숫자로 저장된다.(연산가능)
    //                  호출하면 문자로 나온다. 
	
	
}
